EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/ASJet_simpleFoam_kOmega/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<tensor> 
4520
(
(6.6253299e-15 2.4983631e-28 4.7852844e-23 -9.0692126e-11 7.2989533e-07 7.2551876e-17 0 1.4510651e-16 2.7793236e-11)
(3.0240866e-14 -9.8825787e-27 6.0778553e-23 0 7.0341252e-07 6.9919474e-17 1.2735876e-12 1.3984161e-16 2.6784813e-11)
(-6.0233842e-14 -4.7514075e-28 -9.1006934e-23 7.4167388e-11 6.7926662e-07 6.7519362e-17 0 1.350413e-16 2.5865376e-11)
(6.2506678e-14 -1.9255036e-28 -3.6880478e-23 0 6.6316139e-07 6.5918496e-17 0 1.318395e-16 2.5252115e-11)
(-1.7127572e-14 6.6539316e-28 1.2744727e-22 0 6.5602319e-07 6.5208956e-17 0 1.304204e-16 2.4980304e-11)
(-1.6915595e-14 7.9594829e-27 -1.0551355e-22 -1.3601629e-10 6.5746762e-07 6.5352534e-17 0 1.3070756e-16 2.5035306e-11)
(5.0466443e-15 1.0476482e-28 2.0066318e-23 0 6.6703504e-07 6.6303539e-17 1.1052503e-12 1.326096e-16 2.5399618e-11)
(5.6382461e-14 9.2328007e-27 -4.9991312e-23 0 6.8423274e-07 6.8012997e-17 5.9271118e-13 1.3602858e-16 2.6054478e-11)
...
)
;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
24
(
(6.7813708e-22 -4.6423928e-20 -8.8918901e-15 -9.0692126e-11 7.2989533e-07 7.2551876e-17 -2.1196418e-18 1.451065e-16 2.7793233e-11)
(-1.0099031e-20 -1.3771628e-20 -2.6377238e-15 3.1481518e-11 2.027389e-07 2.0152324e-17 2.9557381e-17 4.0305411e-17 7.7199691e-12)
(-1.1270498e-20 -6.1825735e-21 -1.1841971e-15 -3.8964748e-32 9.4454397e-08 9.3888033e-18 3.4231016e-17 1.8777962e-17 3.5966706e-12)
(8.6350534e-17 -3.4570057e-21 -6.6213859e-16 6.5515471e-12 5.1536035e-08 5.1227017e-18 -2.5592082e-13 1.0245597e-17 1.9624088e-12)
(-8.1103396e-17 -2.0259082e-21 -3.8803596e-16 5.1808438e-12 3.0511648e-08 3.0328695e-18 2.4283496e-13 6.0658537e-18 1.1618342e-12)
(4.7312208e-17 -1.2646414e-21 -2.4222536e-16 0 1.914873e-08 1.9033911e-18 -1.4242035e-13 3.8068543e-18 7.2915265e-13)
(1.1829273e-17 -8.4163509e-22 -1.6120496e-16 2.3002337e-32 1.2677995e-08 1.2601976e-18 -3.5424907e-14 2.5204428e-18 4.8275753e-13)
(-1.3602024e-17 -5.8905017e-22 -1.1282478e-16 0 8.8805252e-09 8.8272761e-19 4.0767697e-14 1.7654886e-18 3.3815603e-13)
...
)
;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
24
(
(5.3799879e-14 3.8012193e-29 7.1075553e-24 -5.9189386e-13 3.0837849e-09 3.065294e-19 -265350.71 0 0)
(-2216.6119 -5.3134416e-21 -1.0177196e-15 4.7034897e-13 3.0857168e-09 3.0672144e-19 -255896.03 4.6037218e-23 8.8156479e-18)
(-23264.411 -5.7674487e-20 -1.1046787e-14 0 3.1091849e-09 3.0905417e-19 -247143.86 5.4290768e-21 1.039868e-15)
(-45202.445 -1.1435558e-19 -2.1903298e-14 0 3.1757377e-09 3.1566955e-19 -241085.07 2.1441194e-20 4.106777e-15)
(-63463.226 -1.6271328e-19 -3.116558e-14 1.4101856e-11 3.2893927e-09 3.2696686e-19 -238147.16 4.3361045e-20 8.3052353e-15)
(-78695.923 -2.0423552e-19 -3.9118615e-14 -5.5512864e-13 3.4503737e-09 3.4296843e-19 -238324.07 6.7439693e-20 1.2917182e-14)
(-91470.876 -2.4094993e-19 -4.6150773e-14 1.7051305e-11 3.6597013e-09 3.6377572e-19 -241566.7 9.1237331e-20 1.7475304e-14)
(-102155.13 -2.7455541e-19 -5.2587462e-14 1.9226579e-11 3.9190029e-09 3.8955035e-19 -247771.02 1.1319823e-19 2.1681627e-14)
...
)
;
    }
    inflow1
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
24
(
(0 0 0 0 2.1743251e-09 2.1612875e-19 16528.436 4.3226577e-19 8.2794799e-14)
(0 0 0 -6.4742758e-13 2.1698776e-09 2.1568667e-19 4.3195559e-12 4.3138147e-19 8.2625423e-14)
(0 0 0 0 2.1646278e-09 2.1516484e-19 -3.6828918e-12 4.3033783e-19 8.2425527e-14)
(0 0 0 -3.9851487e-13 2.157968e-09 2.1450284e-19 -6.039991e-13 4.2901389e-19 8.2171943e-14)
(0 0 0 0 2.1491411e-09 2.1362545e-19 1.8354034e-12 4.2725906e-19 8.183583e-14)
(0 0 0 0 2.1371668e-09 2.124352e-19 -5.0103716e-13 4.2487848e-19 8.137986e-14)
(0 0 0 0 2.1207562e-09 2.1080398e-19 -1.2289375e-12 4.2161599e-19 8.0754974e-14)
(0 0 0 0 2.0982181e-09 2.0856368e-19 2.946103e-13 4.171353e-19 7.9896756e-14)
...
)
;
    }
    wall2
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
15
(
(0 -5.8419285e-28 -1.119073e-22 0 2.1743251e-09 2.1612875e-19 33077.967 0 0)
(5.9311192e-15 1.6121039e-28 3.1270192e-23 -3.854604e-13 2.1743111e-09 2.1612736e-19 32857.772 0 0)
(-2.360311e-14 -4.3248986e-28 -8.225221e-23 0 2.1742979e-09 2.1612604e-19 32652.181 0 0)
(-1.0678847e-14 3.0606808e-28 5.9237422e-23 2.0497762e-13 2.1742852e-09 2.1612478e-19 32457.469 0 0)
(1.4873406e-14 6.2287615e-28 1.186886e-22 0 2.1742728e-09 2.1612355e-19 32270.279 0 0)
(6.3701959e-15 -2.149546e-28 -4.0393271e-23 0 2.1742597e-09 2.1612225e-19 32073.844 0 0)
(1861.935 -2.5422177e-20 -4.8692822e-15 2.7145591e-13 2.1926051e-09 2.1794578e-19 31816.598 1.4877279e-21 2.8495463e-16)
(16097.563 -1.9359129e-19 -3.7079858e-14 -2.8382203e-13 2.3959381e-09 2.3815717e-19 31338.628 9.9441109e-20 1.9046632e-14)
(17678.683 -2.4984647e-19 -4.7854933e-14 1.0138664e-11 2.9023911e-09 2.8849876e-19 30621.559 1.4424515e-19 2.7627991e-14)
(17295.062 -3.1461477e-19 -6.0260443e-14 -2.0038908e-11 3.6547822e-09 3.6328677e-19 29957.077 1.8163759e-19 3.4790046e-14)
(16990.6 -3.9904092e-19 -7.6431017e-14 -5.629844e-12 4.6355244e-09 4.6077292e-19 29429.721 2.3037747e-19 4.4125762e-14)
(16770.003 -4.9637184e-19 -9.5073306e-14 4.939438e-12 5.766174e-09 5.7315991e-19 29047.609 2.8656748e-19 5.4888497e-14)
(16620.73 -5.9366938e-19 -1.1370935e-13 4.5450778e-12 6.8964486e-09 6.8550963e-19 28789.074 3.427396e-19 6.5647558e-14)
(16524.514 -6.7790072e-19 -1.2984293e-13 7.2656205e-12 7.8749432e-09 7.8277237e-19 28622.391 3.9137123e-19 7.496199e-14)
(16464.441 -7.4216645e-19 -1.4215218e-13 -2.2027168e-12 8.6214989e-09 8.5698029e-19 28518.353 4.284734e-19 8.2068421e-14)
)
;
    }
    inflow2
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
79
(
(1.5917623e-14 5.4857893e-21 1.0507303e-15 7.5721879e-17 2.1324089e-10 2.1196226e-20 2.0954752e-15 7.2217526e-22 1.3832337e-16)
(2.6788726e-14 5.4730095e-21 1.0482827e-15 0 2.1274408e-10 2.1146843e-20 3.5266025e-15 7.2049445e-22 1.3800119e-16)
(-1.2722701e-14 5.4609106e-21 1.0459653e-15 0 2.1227383e-10 2.11001e-20 -1.6748794e-15 7.1890136e-22 1.3769606e-16)
(-2.7984583e-14 5.4493013e-21 1.043742e-15 2.532498e-14 2.1182265e-10 2.1055253e-20 -3.6840301e-15 7.173732e-22 1.374034e-16)
(-1.6907246e-14 5.4380058e-21 1.041578e-15 0 2.1138343e-10 2.1011594e-20 -2.2257545e-15 7.1588631e-22 1.3711855e-16)
(6.3497407e-15 5.4270813e-21 1.0394857e-15 4.4759032e-14 2.1095879e-10 2.0969385e-20 8.359116e-16 7.144481e-22 1.368431e-16)
(1.4413362e-14 5.4153661e-21 1.0372418e-15 0 2.1050348e-10 2.0924126e-20 1.8974466e-15 7.1290566e-22 1.3654766e-16)
(3.6694167e-15 5.4020797e-21 1.0346971e-15 0 2.0998697e-10 2.0872785e-20 4.8306037e-16 7.1115679e-22 1.362127e-16)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
56
(
(0 0 0 -4.8148067e-11 3.9115725e-07 3.888118e-17 0 7.7763841e-17 1.4894637e-11)
(0 0 0 1.5172605e-11 1.2855716e-07 1.2778631e-17 2.3707195e-13 2.5557748e-17 4.895249e-12)
(0 0 0 8.5522096e-12 7.5612161e-08 7.5158778e-18 2.6725655e-13 1.5032042e-17 2.879189e-12)
(0 0 0 5.7296359e-12 5.2884121e-08 5.2567019e-18 0 1.0513604e-17 2.013742e-12)
(0 0 0 4.1754467e-12 4.0251941e-08 4.0010583e-18 -5.2193084e-13 8.002269e-18 1.5327289e-12)
(0 0 0 0 3.2214286e-08 3.2021124e-18 -1.4990899e-13 6.4043466e-18 1.226668e-12)
(0 0 0 0 2.6652571e-08 2.6492757e-18 7.1188083e-13 5.2986523e-18 1.0148869e-12)
(0 0 0 0 2.2577346e-08 2.2441969e-18 -4.4849667e-13 4.4884792e-18 8.597089e-13)
...
)
;
    }
    wall3
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 8((2050.1 -3.4721847e-32 -6.6505111e-27 0 9.2420092e-09 9.1865926e-19 3.9961021e-11 1.8373537e-18 3.5192083e-13) (2083.5786 -3.4674854e-32 -6.6415103e-27 0 9.2295023e-09 9.1741606e-19 4.8862475e-11 1.8348669e-18 3.5144451e-13) (2108.3404 -3.4610501e-32 -6.6291841e-27 7.2703004e-29 9.2123736e-09 9.1571347e-19 3.6187657e-11 1.8314618e-18 3.5079232e-13) (2125.8292 -3.4522441e-32 -6.6123174e-27 1.9821236e-12 9.1889329e-09 9.1338345e-19 3.8124465e-11 1.8268016e-18 3.4989972e-13) (2134.3928 -3.4403189e-32 -6.5894765e-27 -1.4765635e-28 9.1571923e-09 9.1022842e-19 4.4398532e-11 1.8204915e-18 3.4869109e-13) (2141.1072 -3.4246152e-32 -6.559398e-27 0 9.1153923e-09 9.0607349e-19 3.9736557e-11 1.8121816e-18 3.4709945e-13) (2145.2369 -3.4047863e-32 -6.5214178e-27 3.4976198e-28 9.0626129e-09 9.008272e-19 4.0422341e-11 1.8016887e-18 3.4508967e-13) (2147.4699 -3.3810676e-32 -6.4759879e-27 2.930902e-28 8.9994808e-09 8.9455184e-19 3.9983164e-11 1.7891377e-18 3.4268569e-13));
    }
}


// ************************************************************************* //
