EnKF-for-inverse-problems/ensemble-based-learning/cases/axisymmetric-subsonic-jet_/inputs/ASJet_simpleFoam_kOmega/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      7.5847e+3;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    axis
    {
        type            empty;
	}
    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
    wall1
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    inflow1
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    wall2
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    inflow2
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall3
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
